# taps
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# installs
brew "cmake"
brew "coreutils"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "gcc"
brew "gifsicle"
brew "git"
brew "libomp"
brew "openjdk"
brew "pandoc"
brew "protobuf"
brew "python"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "tmux"
brew "vim"
brew "wget"
brew "qmk/qmk/qmk"

# casks
cask "clion"
cask "discord"
cask "disk-inventory-x"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "mactex"
cask "miniconda"
cask "obsidian"
cask "rectangle"
cask "skim"
cask "steam"
cask "visual-studio-code"
